#Напишите программу, которая выводит такое «окно» на экран.

#Первый вариант
# ==============================
# Привет
# друг
# ==============================

# Второй вариант
# ==============================
# ||        Привет            ||
# ||         друг             ||
# ==============================

#Третий вариант
# ==============================
# ||                          ||
# ||                          ||
# ||          Привет,         ||
# ||          друг!           ||
# ||                          ||
# ||                          ||
# ==============================

#Размер окна может быть любым,
#вместо слова «друг» можете написать своё имя.
#Постарайтесь добиться результата из третьего варианта.
print('Задание 2.\n')

border = '=============================='
spacer = '||' + ' '*26 + '||'

print('Первый вариант')
print(f'{border}\nПривет\nПётр\n{border}')

print('\nВторой вариант')
print(f"{border}")
print(f"||{'Привет':^26}||")
print(f"||{'Пётр':^26}||")
print(f"{border}")

print('\nТретий вариант')
print(f"{border}")
print(f"{(spacer + chr(10))*2}", end="")
print(f"||{'Привет,':^26}||")
print(f"||{'Пётр!':^26}||")
print(f"{(spacer + chr(10))*2}", end="")
print(f"{border}")
