print('Задача 10. Кинотеатр')

# X мальчиков и Y девочек пошли в кинотеатр
# и купили билеты на подряд идущие места в одном ряду.
#
# Напишите программу,
# которая выдаст, как нужно сесть мальчикам и девочкам,
# чтобы рядом с каждым мальчиком сидела хотя бы одна девочка,
# а рядом с каждой девочкой — хотя бы один мальчик.
#
# На вход подаются два числа - кол-во мальчиков X и кол-во девочек Y.
# В ответе выведите какую-нибудь строку,
# в которой будет ровно X символов “B” (обозначающих мальчиков)
# и Y символов “G” (обозначающих девочек), удовлетворяющую условию задачи.
# Пробелы между символами выводить не нужно.
# Если рассадить мальчиков и девочек согласно условию задачи невозможно,
# выведите строку “Нет решения”.
#
#
# Пример 1:
#
# Введите кол-во мальчиков: 5
# Введите кол-во девочек: 5
# Ответ: BGBGBGBGBG
#
# Пример 2:
#
# Введите кол-во мальчиков: 5
# Введите кол-во девочек: 3
# Ответ: BGBGBBGB
#
# Пример 3:
#
# Введите кол-во мальчиков: 100
# Введите кол-во девочек: 1
# Ответ: Нет решения
boys = int(input('Введите кол-во мальчиков: '))
girls = int(input('Введите кол-во девочек: '))
row = ''

if boys <= 0 or girls <= 0 or (boys > 2 * girls) or (girls > 2 * boys):
    row = 'Нет решения'

elif boys >= girls:
    diff = boys - girls

    for seat in range(diff):
        row += 'BGB'

    for seat in range(girls - diff):
        row += 'BG'

else:
    diff = girls - boys

    row += 'GBG' * diff
    row += 'GB' * (boys - diff)

print(f'Ответ: {row}')
